import 'package:flutter/material.dart';

class ServiceBlogModel {
  final IconData icon;
  final String title, content;
  final String? blogTitle;

  ServiceBlogModel({
    required this.icon,
    required this.title,
    required this.content,
    this.blogTitle,
  });
}

List<ServiceBlogModel> blogs = [
  ServiceBlogModel(
    icon: Icons.keyboard,
    title: 'عقد تقديم خدمات الكترونية',
    content:
        '''هو عقد قانوني عقد الإدارة والتشغيل أو أتفاقية إدارة ويسمى أيضا عقد موقع الكتروني ، يكون هذا العقد بين طرفين أحدهم يملك الموقع والأخر يقوم بتنفيذ و تشغيل الموقع لصالح المالك . 
هي وثيقة تنظم وتفصل العلاقة بين مدير الخدمة وشركة أو شخص. إنها اتفاقية خدمة يمكنك إرسالها مع الشروط والأحكام الخاصة باقتراحك إلى العميل.

عادةً ما تغطي اتفاقية إدارة الموقع الإلكتروني أشياء مثل كيف ومتى سيتم الدفع لك وكيف ستتمكن من الوصول إلى منصات الطرف الثالث مثل Facebook أو Google أو Instagram أو LinkedIn أو أنظمة أخرى.''',
  ),
  ServiceBlogModel(
    icon: Icons.checklist,
    title: 'العقود الاستشارية',
    content:
        '''عقد الاستشارة هو عقد بين شركة ومستشار، يحدد الخدمات المقدمة وشروط كل منها. فهو يحدد نوع المهمة التي يتعين القيام بها، وجدول الدفع، والمعايير الحاسمة الأخرى لكلا الطرفين.
اتفاقية الاستشارة هي وثيقة تعاقدية تصف علاقة العمل بين شركة ومستشار يقدم لتلك الشركة خدماتها. تشمل المصطلحات الأخرى المستخدمة للإشارة إلى اتفاقية الاستشارة ما يلي:
– اتفاقية استشارات الأعمال
– اتفاقية المقاول المستقل
– عقد العمل الحر
– عقد الاستشارة
تشرح اتفاقية الاستشارة شروط العلاقة المهنية كوسيلة لإبقاء الطرفين مسؤولين عندما يتعلق الأمر بنوع العمل والتعويض المتوقع.''',
  ),
  ServiceBlogModel(
    icon: Icons.desktop_mac_outlined,
    title: 'عقد بيع برنامج',
    content:
        '''عقد بيع البرامج هو عقد قانوني بينك وبين العميل وموفر البرنامج الذي يحدد الشروط والأحكام الخاصة بنموذج تسليم البرنامج. تهدف هذه الاتفاقية إلى التأكد من فهم كل طرف لأدواره ومسؤولياته. كما أنها تحمل شركات البرمجيات مسؤولية خدمة منتجاتها وتقديم الدعم الفني إذا لزم الأمر.
هناك العديد من النقاط الرئيسية التي يجب أن تغطيها اتفاقية عقد البرنامج. يتضمن ذلك من هم الأطراف المعنية، وما المتوقع منهم القيام به، وأي شروط وأحكام تتعلق بمبيعات البرامج، وتفاصيل حول الضمانات والتراخيص والترقيات.''',
  ),
  ServiceBlogModel(
    icon: Icons.balance_rounded,
    title: 'سياسة الخصوصية للبرمجيات',
    blogTitle: 'سياسة الخصوصية',
    content:
        '''سياسة الخصوصية هي وثيقة قانونية تشرح كيفية تعامل المؤسسة مع أي معلومات خاصة بالعميل أو العميل أو الموظف يتم جمعها في عملياتها.

وسيشمل كيفية جمع البيانات وتخزينها واستخدامها ومشاركتها وحمايتها وحقوق المستخدم فيما يتعلق بالبيانات. وهو مطلوب بموجب قانون الاتحاد الأوروبي وولاية كاليفورنيا والولايات القضائية الأخرى.
قد تكون سياسة الخصوصية مطلوبة للامتثال للخصوصية .
يجب أن تحدد سياسة الخصوصية أي معلومات تعريف شخصية  يتم جمعها، مثل الاسم والعنوان ورقم بطاقة الائتمان''',
  ),
  ServiceBlogModel(
    icon: Icons.contacts_sharp,
    title: 'إسوب ( ESOP )',
    blogTitle: 'اسهم الموظفين',
    content:
        '''خطة خيار أسهم الموظفين أو خطة ملكية أسهم الموظفين (ESOP) هي خطة استحقاقات الموظفين ﺍﻟﺘﻲ تمكن الموظفين من امتلاك أسهم في الشركة. ويتم شراء هذه الأسهم من قبل الموظفين بسعر أقل من سعر السوق، أو بمعنى آخر بسعر مخفض.
الغرض من توفير برنامج ESOP هو جعل الموظف أكثر التزامًا تجاه الشركة. بمعنى آخر، يحفز برنامج ESOP الموظف ﻋﻠﻰ الالتزام تجاه الشركة على المدى الطويل وكذلك الحصول على ملكية الشركة.
إذا تم تزويد الموظفين بشعور بملكية الشركة من خلال جعلهم مساهمين في الشركة، فسيؤدي ذلك إلى تركيز الموظفين بشكل أكبر على الأداء الأفضل للشركة.
ومع ذلك، من أجل المطالبة بفوائد برنامج إسوب، يتعين على الموظفين الانتظار لفترة زمنية معينة تعرف باسم فترة الاستحقاق. بعد الانتهاء من فترة الاستحقاق، يمكن للموظفين شراء الكمية المحددة من الأسهم.
يتم منح ESOPs للموظفين على أساس مدة الخدمة أو على الأداء. ولذلك، فإنه يخدم الغرض التالي للشركة.''',
  ),
  ServiceBlogModel(
    icon: Icons.rocket_launch_sharp,
    title: 'تهيئة الشركة الناشئة للأستثمار',
    blogTitle: 'تهيئة الشركات للاستثمار',
    content:
        '''الشركات الناشئة هي شركات أو مشاريع تركز على منتج أو خدمة واحدة يرغب المؤسسون في طرحها في السوق. لا تمتلك هذه الشركات عادةً نموذج أعمال متطورًا بالكامل ، والأهم من ذلك، أنها تفتقر إلى رأس المال الكافي للانتقال إلى المرحلة التالية من الأعمال. يتم تمويل معظم هذه الشركات في البداية من قبل مؤسسيها.تلجأ العديد من الشركات الناشئة إلى الآخرين للحصول على المزيد من التمويل، بما في ذلك العائلة والأصدقاء وأصحاب رؤوس الأموال.''',
  ),
];
