abstract class AppConstants {
  static const location =
      'https://www.google.com/maps/embed?pb=!1m17!1m12!1m3!1d3428.70353630428!2d31.456933!3d30.754828000000003!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m2!1m1!2zMzDCsDQ1JzE3LjQiTiAzMcKwMjcnMjUuMCJF!5e0!3m2!1sar!2seg!4v1741043076133!5m2!1sar!2seg';

  static const textBlogContentJson =
      '[{"insert":"لائحة المنصات الإلكترونية – الشروط والأحكام للمواقع الإلكترونية – أوافق على الشروط والأحكام وسياسة الخصوصية – الشروط والأحكام لتطبيق – الشروط والأحكام بالانجليزي – الشروط والاحكام متجر – المنصات القانونية – ناجز –","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"في عالم الأعمال الرقمي اليوم، تُعدّ كتابة شروط وأحكام الاستخدام خطوة ضرورية لحماية موقعك الإلكتروني وضمان امتثالك للقوانين واللوائح السعودية. تُوضح هذه الشروط والأحكام حقوقك والتزاماتك تجاه زوار موقعك، وتُساعد على حل النزاعات وتحديد المسؤوليات بوضوح.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"أ","attributes":{"size":"large"}},{"insert":"همية كتابة شروط وأحكام الاستخدام","attributes":{"size":"huge","bold":true,"font":"nunito"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"حماية الملكية الفكرية","attributes":{"link":"http://proxy-law.com/"}},{"insert":" :","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"بناء الثقة مع العملاء :","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"تحديد المسؤوليات :","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"الامتثال للقوانين السعودية :","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"احمِ نفسك من المتاعب القانونية :","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"دليل كتابة شروط وأحكام الاستخدام للمواقع السعودية","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"١. المقدمة : حدد هوية موقعك الإلكتروني ونوع الخدمات التي تقدمها.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٢. تحديثات شروط الخدمة : اشرح كيف ستُعلم المستخدمين بأي تغييرات تُجرى على شروط وأحكام الاستخدام.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٣. الموافقة على الشروط : أوضح أن استخدام موقعك الإلكتروني يُعدّ موافقة على شروط وأحكام الاستخدام.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٤. مسؤوليات المستخدم : حدد قواعد السلوك المتوقعة من المستخدمين عند استخدام موقعك الإلكتروني.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٥. الأنشطة المحظورة : اشرح ما يُعدّ نشاطًا محظورًا على موقعك الإلكتروني، مثل محاولة اختراق أنظمة الأمان أو نشر محتوى ضار.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٦. ملكية الموقع والمحتوى : حدد من يملك حقوق الملكية الفكرية للمحتوى الموجود على موقعك الإلكتروني.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٧. حقوق الوصول : اشرح كيفية استخدام المستخدمين لمحتوى موقعك الإلكتروني، وما هي القيود المفروضة على استخدامه.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٨. حقوق الشركة : حدد حقوقك كصاحب موقع إلكتروني، بما في ذلك الحق في إنهاء حسابات المستخدمين واتخاذ الإجراءات القانونية.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"٩. المسؤولية وإخلاء المسؤولية والتعويض : حدد مسؤولياتك تجاه المستخدمين، وأخلي مسؤوليتك عن أي أضرار أو خسائر قد تنجم عن استخدام موقعك الإلكتروني.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"١٠. سياسة الخصوصية : أضف رابطًا إلى سياسة الخصوصية الخاصة بك، والتي تُوضح كيفية جمعك واستخدامك لبيانات المستخدمين.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"١١. القانون الحاكم : حدد القانون الذي يحكم شروط وأحكام الاستخدام.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"وذلك بصفة عامة ، قد تختلف بعض البنود حسب نشاط الموقع وما يقدمه من خدمات","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"توجيهات لكتابة شروط وأحكام الاستخدام","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"أولا : وضوح اللغة المستخدمه","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"ثانيا : تحديد الالتزامات والحقوق","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"ثالثا : ضمان حماية المعلومات الشخصية","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"الفرق بين سياسة الاستخدام وشروط الخصوصية:","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"على الرغم من أنهما وثيقتان قانونيتان مهمتان لمواقع الويب، إلا أن سياسة الاستخدام تختلف عن شروط الخصوصية.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"فسياسة الاستخدام تحدد قواعد سلوك المستخدمين عند استخدام موقع الويب أو الخدمة وتهدف إلى حماية الموقع الإلكتروني وضمان استخدامه بطريقة آمنة ومسؤولة من قبل جميع المستخدمين.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"أما شروط الخصوصية فتحدد كيفية جمع موقع الويب واستخدامه ومشاركة بيانات المستخدمين الشخصية وتهدف إلى حماية خصوصية المستخدمين وضمان امتثال الموقع الإلكتروني لقوانين حماية البيانات.","attributes":{"size":"large"}},{"insert":"\\n\\n","attributes":{"align":"left"}},{"insert":"إذا كنت بحاجة إلى مساعدة في كتابة شروط وأحكام الاستخدام، تواصل معنا","attributes":{"size":"large"}},{"insert":"\\n","attributes":{"align":"left"}},{"insert":"مواضيع ذات صلة : دليل القانون الكتابة الأحكام المواقع في المملكة العربية السعودية الرياض – قانون العمل – الدليل السعودي ﻜﺘﺎﺒﺔ و صياغة الأحكام اﻟﺨﺼﻮﺻﻴﺔ لمواقع اﻟﺘﻮاﺻﻞ اﻻﺟﺘﻤﺎﻋﻲ – المسطرة الجنائية – اليونيسيف – القانون المدني – القانون المصرى – عملية اﻟﺒﺤﺚ عن اﻟﻌﻤﻞ ﻣﻦ المملكة – ﺍﻟﺪﻟﻴﻞ ﻋﻠﻰ مخاطر عدم صياغة الأحكام – الوكيل القانوني المحاماة والاستشارات – نقدم خدمات ﻣﻦ تمثيل للأشخاص – نظام الموارد البشرية – يهدف القانون وتتضمن الأحكام البناء – اسم الحي – ﺩﻟﻴل املراجعة قانونية – ﻭﻟﺘﻔﻌل ﻜل ﺸﺭﻭﻁ ﺍﻟﻘﺎﻨﻭﻥ بشكل قانوني ضمن الحماية القانونيـة بموجب تدابير لتحسين وتطوير الاستيراد والتصدير – ﺍﻟﴩﻭﻁ ﻓﻲ اﻟﻘﺎﻧﻮن – وتتضمن الأحكام ﻓﻲ صياغة خدمات المواقع يتم ﺧﻼل بنفس و بواسطة مـن اســـم الدليلين – ﺣﻘﻮﻕ التأمين وال","attributes":{"size":"large"}},{"insert":"\\n\\n\\n","attributes":{"align":"left"}}]';

  static const whatsappNumber = '01050764021';
  static const email = 'maher.law3@gmail.com';

  static const bio =
      '''الوسيط القانوني هي مؤسسة قانونية تقدم مجموعة واسعة من الخدمات القانونية بكفاءة واحترافية عالية. إليك بعض الخصائص التي تميز الوسيط القانوني:
1. الخبرة والتخصص:
 * نضم فريقًا من المحامين ذوي الخبرة والكفاءة العالية في مختلف فروع القانون، مثل القانون المدني، والقانون الجنائي، والقانون التجاري، وقانون الشركات، وقانون الأحوال الشخصية.
 * نتميز بتخصص في مجالات قانونية محددة، مما يجعله وجهة موثوقة للعملاء الذين يبحثون عن خبرة متخصصة.
2. السمعة الطيبة والمصداقية:
 * نتمتع بسمعة طيبة ومصداقية عالية في المجتمع القانوني وبين العملاء.
 * نحافظ على سرية معلومات العملاء ويضع مصلحتهم في المقام الأول.
3. التواصل الفعال والشفافية:
 * نتواصل مع العملاء بشكل فعال ومنتظم، ونطلعهم على آخر التطورات في قضاياهم.
 * نتسم بالشفافية في التعامل مع العملاء، ويشرح لهم الإجراءات القانونية بشكل واضح ومبسط.
4. الكفاءة والاحترافية:
 * نقدم خدمات قانونية عالية الجودة بكفاءة واحترافية.
 * نستخدم أحدث التقنيات والأدوات القانونية لإنجاز المهام بسرعة وفعالية.
5. خدمة العملاء الممتازة:
 * نقدم خدمة عملاء ممتازة، ويلبي احتياجات العملاء بشكل فعال.
 * نستجيب لاستفسارات العملاء بسرعة ونوفر لهم الدعم اللازم.
6. التقييم العالي:
 * يتمتع الوسيط القانوني بتقييم عالي من قبل العملاء الذين تعاملوا معه.
7. الموقع:
 * يقع المكتب في موقع مناسب يسهل الوصول إليه.
8. الخدمات التي يقدمها الوسيط القانوني:
 * الاستشارات القانونية.
 * التمثيل القانوني أمام المحاكم والهيئات القضائية.
 * صياغة العقود والاتفاقيات القانونية.
 * التحكيم والوساطة.
 * الخدمات القانونية للشركات.
 * الخدمات القانونية للأفراد.
9. فريق العمل:
 * يتميز الوسيط القانوني بفريق عمل متكامل ومتعاون.
10. الأتعاب:
 * يحدد أتعابه بشكل واضح وشفاف قبل البدء في أي عمل قانوني.
 الخدمات الإضافية:
 * يقدم الوسيط القانوني خدمات إضافية مثل الترجمة القانونية أو التوثيق.

 الوسيط القانوني هو الذي يجمع بين الخبرة والكفاءة والسمعة الطيبة وخدمة العملاء الممتازة، ويسعى دائمًا لتحقيق أفضل النتائج لعملائه.''';
}
