abstract class AppConstants {
  static const whatsappNumber = '01050764021';
  static const email = 'maher.law3@gmail.com';

  static const bio =
      '''الوسيط القانوني هي مؤسسة قانونية تقدم مجموعة واسعة من الخدمات القانونية بكفاءة واحترافية عالية. إليك بعض الخصائص التي تميز الوسيط القانوني:
1. الخبرة والتخصص:
 * نضم فريقًا من المحامين ذوي الخبرة والكفاءة العالية في مختلف فروع القانون، مثل القانون المدني، والقانون الجنائي، والقانون التجاري، وقانون الشركات، وقانون الأحوال الشخصية.
 * نتميز بتخصص في مجالات قانونية محددة، مما يجعله وجهة موثوقة للعملاء الذين يبحثون عن خبرة متخصصة.
2. السمعة الطيبة والمصداقية:
 * نتمتع بسمعة طيبة ومصداقية عالية في المجتمع القانوني وبين العملاء.
 * نحافظ على سرية معلومات العملاء ويضع مصلحتهم في المقام الأول.
3. التواصل الفعال والشفافية:
 * نتواصل مع العملاء بشكل فعال ومنتظم، ونطلعهم على آخر التطورات في قضاياهم.
 * نتسم بالشفافية في التعامل مع العملاء، ويشرح لهم الإجراءات القانونية بشكل واضح ومبسط.
4. الكفاءة والاحترافية:
 * نقدم خدمات قانونية عالية الجودة بكفاءة واحترافية.
 * نستخدم أحدث التقنيات والأدوات القانونية لإنجاز المهام بسرعة وفعالية.
5. خدمة العملاء الممتازة:
 * نقدم خدمة عملاء ممتازة، ويلبي احتياجات العملاء بشكل فعال.
 * نستجيب لاستفسارات العملاء بسرعة ونوفر لهم الدعم اللازم.
6. التقييم العالي:
 * يتمتع الوسيط القانوني بتقييم عالي من قبل العملاء الذين تعاملوا معه.
7. الموقع:
 * يقع المكتب في موقع مناسب يسهل الوصول إليه.
8. الخدمات التي يقدمها الوسيط القانوني:
 * الاستشارات القانونية.
 * التمثيل القانوني أمام المحاكم والهيئات القضائية.
 * صياغة العقود والاتفاقيات القانونية.
 * التحكيم والوساطة.
 * الخدمات القانونية للشركات.
 * الخدمات القانونية للأفراد.
9. فريق العمل:
 * يتميز الوسيط القانوني بفريق عمل متكامل ومتعاون.
10. الأتعاب:
 * يحدد أتعابه بشكل واضح وشفاف قبل البدء في أي عمل قانوني.
 الخدمات الإضافية:
 * يقدم الوسيط القانوني خدمات إضافية مثل الترجمة القانونية أو التوثيق.

 الوسيط القانوني هو الذي يجمع بين الخبرة والكفاءة والسمعة الطيبة وخدمة العملاء الممتازة، ويسعى دائمًا لتحقيق أفضل النتائج لعملائه.''';
}
